app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Иван"], ["body", "Просто комментарий"], ["post_id", 3], ["created_at", "2019-08-15 18:22:20.181189"], ["updated_at", "2019-08-15 18:22:20.181189"]]
---
  def create
@post = Post.find(params[:post_id])
@comment = @post.comments.create(comment_params)