app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Проверка"], ["body", "Новая статья"], ["created_at", "2019-08-15 18:24:26.846528"], ["updated_at", "2019-08-15 18:24:26.846528"]]
---
  def create
#render plain: params[:post].inspect
    @post = Post.new(post_params)
    if(@post.save)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Статья 1нг"], ["updated_at", "2019-08-15 15:49:50.729892"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if(@post.update(post_params))